labs/student/examples/jaxws/Managers/generated/xml/AirportManagerService.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2-b02-rc1. -->
<definitions targetNamespace="http://server.jaxws.example.com/" name="AirportManagerService" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:tns="http://server.jaxws.example.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://server.jaxws.example.com/" schemaLocation="AirportManagerService_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="addAirport">
    <part name="parameters" element="tns:addAirport"/>
  </message>
  <message name="addAirportResponse">
    <part name="parameters" element="tns:addAirportResponse"/>
  </message>
  <portType name="AirportManager">
    <operation name="addAirport">
      <input wsam:Action="http://server.jaxws.example.com/AirportManager/addAirportRequest" message="tns:addAirport"/>
      <output wsam:Action="http://server.jaxws.example.com/AirportManager/addAirportResponse" message="tns:addAirportResponse"/>
    </operation>
  </portType>
  <binding name="AirportManagerPortBinding" type="tns:AirportManager">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="addAirport">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="AirportManagerService">
    <port name="AirportManagerPort" binding="tns:AirportManagerPortBinding">
      <soap:address location="REPLACE_WITH_ACTUAL_URL"/>
    </port>
  </service>
</definitions>

